### Constants
ε₀ = 
α = 
mₑ = 
Λ₂ = 8.227 # s^-1

### Stepping Functions
φ₂(Tᵦ) = 0.448 * log(ε₀ / Tᵦ)
α₂(Tᵦ) = (64 * π * α^2)/(sqrt(27 * π) * mₑ^2) * sqrt(ε₀ / Τᵦ) * φ₂(Tᵦ)

β(Tᵦ) = α₂(Tᵦ) * ((mₑ * Tᵦ) / (2 * π))^(3/2) * exp(-ε₀ / Tᵦ)
β₂(Tᵦ) = β(Tᵦ) * exp((3 * ε₀) / (4 * Tᵦ))

Λₐ(Xₑ) = (H * (3 * ε₀)^3)/((8 * π)^2 * (1 - Xₑ) * nₕ) # H, nₕ ??? Xₑ????
Cᵣ(Tᵦ, Xₑ) = (Λ₂ + Λₐ(Xₑ)) / (Λ₂ + Λₐ(Xₑ) + β₂(Tᵦ))

### Coupled Equations
dXₑ(Tᵦ, Xₑ) = (Cᵣ(Tᵦ, Xₑ) / H) * (β(Tᵦ) * (1 - Xₑ) - nₕ * α₂(Tᵦ) * Xₑ^2) # H, nₕ ????